burgrp/py32-svd/svd/py32f003.svd
        <register>
          <name>IDR</name>
          <displayName>IDR</displayName>
          <description>GPIO port input data register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ID0</name>
              <description>Port input data (y =
							0..15)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ID0</name>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Input is logic low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Input is logic high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID15</name>
              <description>Port input data (y =
							0..15)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID14</name>
              <description>Port input data (y =
							0..15)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID13</name>
              <description>Port input data (y =
							0..15)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID12</name>
              <description>Port input data (y =
							0..15)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID11</name>
              <description>Port input data (y =
							0..15)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID10</name>
              <description>Port input data (y =
							0..15)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID9</name>
              <description>Port input data (y =
							0..15)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID8</name>
              <description>Port input data (y =
							0..15)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID7</name>
              <description>Port input data (y =
							0..15)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID6</name>
              <description>Port input data (y =
							0..15)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID5</name>
              <description>Port input data (y =
							0..15)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID4</name>
              <description>Port input data (y =
							0..15)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID3</name>
              <description>Port input data (y =
							0..15)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID2</name>
              <description>Port input data (y =
							0..15)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
            <field>
              <name>ID1</name>
              <description>Port input data (y =
							0..15)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="ID0"/>
            </field>
          </fields>
        </register>
        <register>
          <name>ODR</name>
          <displayName>ODR</displayName>
          <description>GPIO port output data register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>OD0</name>
              <description>Port output data (y =
							0..15)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>OD0</name>
                <enumeratedValue>
                  <name>Low</name>
                  <description>Set output to logic low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>High</name>
                  <description>Set output to logic high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OD15</name>
              <description>Port output data (y =
							0..15)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD14</name>
              <description>Port output data (y =
							0..15)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD13</name>
              <description>Port output data (y =
							0..15)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD12</name>
              <description>Port output data (y =
							0..15)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD11</name>
              <description>Port output data (y =
							0..15)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD10</name>
              <description>Port output data (y =
							0..15)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD9</name>
              <description>Port output data (y =
							0..15)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD8</name>
              <description>Port output data (y =
							0..15)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD7</name>
              <description>Port output data (y =
							0..15)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD6</name>
              <description>Port output data (y =
							0..15)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD5</name>
              <description>Port output data (y =
							0..15)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD4</name>
              <description>Port output data (y =
							0..15)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD3</name>
              <description>Port output data (y =
							0..15)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD2</name>
              <description>Port output data (y =
							0..15)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
            <field>
              <name>OD1</name>
              <description>Port output data (y =
							0..15)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="OD0"/>
            </field>
          </fields>
        </register>
        <register>
          <name>BSRR</name>
          <displayName>BSRR</displayName>
          <description>GPIO port bit set/reset
					register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BR0</name>
              <description>Port x set bit y (y=
							0..15)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>BR0W</name>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>Resets the corresponding ODx bit</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BR15</name>
              <description>Port x reset bit y (y =
							0..15)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR14</name>
              <description>Port x reset bit y (y =
							0..15)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR13</name>
              <description>Port x reset bit y (y =
							0..15)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR12</name>
              <description>Port x reset bit y (y =
							0..15)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR11</name>
              <description>Port x reset bit y (y =
							0..15)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR10</name>
              <description>Port x reset bit y (y =
							0..15)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR9</name>
              <description>Port x reset bit y (y =
							0..15)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR8</name>
              <description>Port x reset bit y (y =
							0..15)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR7</name>
              <description>Port x reset bit y (y =
							0..15)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR6</name>
              <description>Port x reset bit y (y =
							0..15)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR5</name>
              <description>Port x reset bit y (y =
							0..15)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR4</name>
              <description>Port x reset bit y (y =
							0..15)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR3</name>
              <description>Port x reset bit y (y =
							0..15)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR2</name>
              <description>Port x reset bit y (y =
							0..15)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BR1</name>
              <description>Port x reset bit y (y =
							0..15)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BR0W"/>
            </field>
            <field>
              <name>BS0</name>
              <description>Port x set bit y (y=
							0..15)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>BS0W</name>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Sets the corresponding ODx bit</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BS15</name>
              <description>Port x set bit y (y=
							0..15)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS14</name>
              <description>Port x set bit y (y=
							0..15)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS13</name>
              <description>Port x set bit y (y=
							0..15)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS12</name>
              <description>Port x set bit y (y=
							0..15)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS11</name>
              <description>Port x set bit y (y=
							0..15)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS10</name>
              <description>Port x set bit y (y=
							0..15)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS9</name>
              <description>Port x set bit y (y=
							0..15)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS8</name>
              <description>Port x set bit y (y=
							0..15)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS7</name>
              <description>Port x set bit y (y=
							0..15)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS6</name>
              <description>Port x set bit y (y=
							0..15)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS5</name>
              <description>Port x set bit y (y=
							0..15)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS4</name>
              <description>Port x set bit y (y=
							0..15)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS3</name>
              <description>Port x set bit y (y=
							0..15)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS2</name>
              <description>Port x set bit y (y=
							0..15)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
            <field>
              <name>BS1</name>
              <description>Port x set bit y (y=
							0..15)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="BS0W"/>
            </field>
          </fields>
        </register>
